trade_exp/src/DataProcessors/РабочееМестоОператораКПП/РабочееМестоОператораКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоОператораКПП</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ИсторияДоступа/ИсторияДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="32cac9b3-ae6b-4910-a190-eb09b563dd2e">
  <name>ИсторияДоступа</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="f854b50d-b2a2-49f4-9700-7fb74d83073a">
    <name>Событие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a6407727-3992-4e5a-b790-d60c98a8142f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9952a41b-07b8-481a-a255-fb5b95356519">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd2a6ea3-7fd0-47b6-b679-c23b2da25507">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2c650d20-0b87-4501-af70-8003f8aec615">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0d0b80b-72a0-4188-8a76-a512cfcb3b5c">
    <name>ТипСканераКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cac5493c-805c-4ac9-bf52-13fdeb63d4fb">
    <name>РезультатСканированияКПП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="fff676fd-7266-4f3d-aa5f-01692611efcb">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51660afc-e03f-4efd-b192-27ff9ed7be7e">
    <name>ЗонаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="f7fba3d7-17e4-4fb7-9502-2fbc431f94c2">
    <name>Датчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1fa77aff-d589-4a53-9548-7872c980796e">
    <name>Объект</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ТипСканераКПП/ТипСканераКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2da93fd9-f5ad-4c92-a203-fb60256df544">
  <name>ТипСканераКПП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="bed78aa2-d465-4478-8643-0a86a3937527">
    <name>Ручной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1545ade1-526c-4277-98e8-c46357b06161">
    <name>СтационарныйВъезд</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be13c22d-0ce1-44ad-a57a-f18b8011416c">
    <name>СтационарныйВыезд</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7f401820-a4c0-466f-8abc-b266a559b7d4">
    <name>СтационарныйСотрудники</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/РезультатСканированияКПП/РезультатСканированияКПП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2fb3f29c-cb3c-473f-9135-a2eda6c2ebfd">
  <name>РезультатСканированияКПП</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="4e5b4d75-c8ab-45e1-8558-e14c93a3e857">
    <name>ПовторноеСканирование</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7bb883e0-68d4-455e-b544-762f74fcd5d5">
    <name>ПовторныйВход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f76b270e-5c9b-4465-8a76-3730f32437c7">
    <name>ОбъектНеНайден</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="52de1986-f064-431a-918c-9e107be52321">
    <name>НеНайденДатчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="290660b2-97d8-49da-9e5d-bcaa25c32dce">
    <name>НетДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b41016b5-5a34-4be3-9d5c-84fd4d8182c7">
    <name>ОбъектУдален</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="46eb4d85-0c0d-41a2-951c-c5a5c239defe">
    <name>ОбъектПросрочен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bd5abca4-95bb-48a7-8d68-1e48e337ffa5">
    <name>УспешныйВход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="e057b567-ff21-4707-8aa0-86e14a1616ba">
    <name>УспешныйВыход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f31636f-5bae-457e-b481-131d3f9e75e6">
    <name>Ошибка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="91a95045-065b-4619-9711-1a31799bb76d">
    <name>СчитанШтрихкодНаСтойке</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СобытиеСКУД/СобытиеСКУД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="35d2c9e5-e6ef-4caf-ab80-71f525e7affa">
  <name>СобытиеСКУД</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="af31e311-ca12-4e8d-9849-5bf05539245c">
    <name>Вход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="efba0129-c70c-4083-94eb-d252d37d7c10">
    <name>Выход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="0de3725f-b285-48a8-b563-9b3b6a56746a">
    <name>Отказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/Пропуск/Пропуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="40c6e6cf-b72f-4a58-bb30-ef44407a6c36">
  <name>Пропуск</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="caf247e2-4077-447f-b4fc-57f2b91b3323">
    <name>Доступ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12cf2cfc-6806-4e64-a645-8eae5aba9e37">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba331897-fef1-466b-a64b-e88432d8bfed">
    <name>ТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c82a20e8-4ecc-4edf-9443-2a129787f88d">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e07e4292-e551-4bc1-881d-20c85b4b9130">
    <name>Расшифровка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0737fcab-2209-423b-9ac2-108aeaf19802">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27a561ad-aa27-442d-be21-2caf93c2a208">
    <name>ВидТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b8b8bab6-8256-4375-8149-d48184352abe">
    <name>НаименованиеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="37f0c450-580f-4ac0-95ae-d5b9d95155fa">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44dd51fe-efa5-42f6-8f36-d29ec59c7464">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0562081-ea83-4c76-b366-04c8aa0d79a0">
    <name>ТипПрохода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d7be871-19e4-4d23-bedb-1c53b2a1a08f">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6abb30b9-96c0-4f1e-904d-30130b54f3fa">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d61bf324-c1d8-45b2-9921-23411a373306">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f37c12d-794f-4909-8515-13506af8c440">
    <name>Прекращен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3789b914-6a24-4b5d-935e-9a5357ce0cef">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9247de40-43c3-41a1-b013-2d5a9c7c42fd">
    <name>РазрешеноУстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d900407b-bf13-4559-9b94-d77a215eb1b3">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Catalogs/ДатчикиСКУД/ДатчикиСКУД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8e2e8795-8c35-4256-9685-7de50417e82f">
  <name>ДатчикиСКУД</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="1c42f308-70b0-4916-a0ee-fb9d3bb04a44">
    <name>УчитыватьВТабеле</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ea05fb9-070b-4c86-8791-175e5fafe106">
    <name>ТипВхода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8e080b2c-30ee-4fa9-91e5-46e066274c5e">
    <name>СКУД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b4a45ca-cc38-45c7-b63f-4b754672951b">
    <name>АдресСервераСКУД</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3e355502-5cf0-4791-8d79-8988e9469645">
    <name>IDШлагбаумаВъезд</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3db656d1-be89-41ec-a44b-ceace876c076">
    <name>IDШлагбаумаВыезд</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/РабочееМестоОператораКПП/Forms/Форма/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала= НачалоДня(ТекущаяДата());
	Период.ДатаОкончания= КонецДня(ТекущаяДата());
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	
	ЭтоСКУД= Датчик.СКУД; 
	
	ПоследнееСканированиеШлагбаумаВъезд = ТекущаяДата();
	ПоследнееСканированиеШлагбаумаВыезд = ТекущаяДата();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода"); 
	
	Ip = ОпределитьIp() ;
	ПолучитьЗначенияПараметров(); 
	
	Если ЭтоСКУД Тогда
		Если ПодключитьВнешнююКомпоненту("ОбщийМакет.RgSoft","RgSoft",AddInType.Native) = Ложь Тогда 
			УстановитьВнешнююКомпоненту("ОбщийМакет.RgSoft"); 
			Если  ПодключитьВнешнююКомпоненту("ОбщийМакет.RgSoft","RgSoft",AddInType.Native) Тогда
				СКУД = Новый("AddIn.RgSoft.RgSoftExtension");
				Сообщить("Подключен СКУД");
			Иначе
				Сообщить("НЕ Подключен СКУД"); 
			КонецЕсли; 
		Иначе
			СКУД = Новый("AddIn.RgSoft.RgSoftExtension");
			Сообщить("СКУД подключен");
		КонецЕсли; 
		Элементы.ФормаОткрытьШлагбаум.Видимость = Истина; 
		Элементы.ФормаОткрытьШлагбаум2.Видимость = Истина; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ВернутьТипСканера(СканерСтрокой) 
	Если СканерСтрокой = "Ручной" Тогда 
		Возврат Перечисления.ТипСканераКПП.Ручной; 
	ИначеЕсли СканерСтрокой = "СтационарныйВъезд" Тогда 
		Возврат Перечисления.ТипСканераКПП.СтационарныйВъезд; 
	ИначеЕсли СканерСтрокой = "СтационарныйВыезд" Тогда 
		Возврат Перечисления.ТипСканераКПП.СтационарныйВыезд;
	ИначеЕсли СканерСтрокой = "СтационарныйСотрудники" Тогда 
		Возврат Перечисления.ТипСканераКПП.СтационарныйСотрудники; 
	Иначе 
		Возврат Перечисления.ТипСканераКПП.Ручной;	
	КонецЕсли; 
КонецФункции  

&НаСервере 
Функция ОбработатьРезультатСканирования(Результат) 
	Если Результат = Перечисления.РезультатСканированияКПП.ПовторныйВход
			ИЛИ Результат = Перечисления.РезультатСканированияКПП.ОбъектНеНайден
			ИЛИ Результат = Перечисления.РезультатСканированияКПП.НеНайденДатчик
			ИЛИ Результат = Перечисления.РезультатСканированияКПП.НетДоступа
			ИЛИ Результат = Перечисления.РезультатСканированияКПП.ОбъектУдален
			ИЛИ Результат = Перечисления.РезультатСканированияКПП.ОбъектПросрочен
			ИЛИ Результат = Перечисления.РезультатСканированияКПП.Ошибка Тогда 
			
			Возврат "fail"; 
		КонецЕсли;
		
		Если Результат = Перечисления.РезультатСканированияКПП.УспешныйВход Тогда 
			Возврат "ok";
		КонецЕсли; 
		
		Если Результат = Перечисления.РезультатСканированияКПП.УспешныйВыход Тогда 
			Возврат "out"; 
		КонецЕсли;  
		Возврат "null"; 
КонецФункции	
		


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)                     	
	ДанныеДатчика = ПолучитьДанныеДатчика(Ip); 
	Если Источник = "ПодключаемоеОборудование"  Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ТипСканераСтрокой = "Ручной"; 
		КонецЕсли;
	КонецЕсли;
	Если Источник = "Шлагбаум" И ДанныеДатчика.СКУД Тогда
		Если ИмяСобытия = "Въезд" Тогда	
			ТипСканераСтрокой = "СтационарныйВъезд"; 
		КонецЕсли;
	КонецЕсли; 
	Если Источник = "Шлагбаум" И ДанныеДатчика.СКУД Тогда
		Если ИмяСобытия = "Выезд" Тогда	
			ТипСканераСтрокой = "СтационарныйВыезд"; 
		КонецЕсли;
	КонецЕсли;
	Если Источник = "СканерСотрудники" И ДанныеДатчика.СКУД Тогда
		Если ИмяСобытия = "ScanData" Тогда	
			ТипСканераСтрокой = "СтационарныйСотрудники"; 
		КонецЕсли;
	КонецЕсли;

	
	БлокировкаОбработки = Ложь;  
	
	Если ТипСканераСтрокой = "СтационарныйВъезд" Тогда 
		Если (ТекущаяДата() - ПоследнееСканированиеШлагбаумаВъезд) < 5 Тогда 
			БлокировкаОбработки = Истина; 
		Иначе	
			ПоследнееСканированиеШлагбаумаВъезд = ТекущаяДата(); 	
		КонецЕсли; 
	КонецЕсли;
	
	Если ТипСканераСтрокой = "СтационарныйВыезд" Тогда 
		Если (ТекущаяДата() - ПоследнееСканированиеШлагбаумаВыезд) < 5 Тогда 
			БлокировкаОбработки = Истина;
		Иначе	
			ПоследнееСканированиеШлагбаумаВыезд = ТекущаяДата();
		КонецЕсли; 
	КонецЕсли; 
	
	Если Не БлокировкаОбработки И ТипЗнч(Параметр) = Тип("Массив") Тогда 
		Данные = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
		Штрихкод = Данные.Штрихкод;	
		ЗарегистрированВход = Неопределено; 
		Попытка 
			РезультатСканирования = УправлениеДоступомСервер.ОбработатьЗапросSKUD(Ip, Штрихкод, Датчик, ЗонаДоступа, ВернутьТипСканера(ТипСканераСтрокой));
		Исключение 
			Сообщить("Неиницилизированная ошибка"); 
		КонецПопытки; 
		Результат = ОбработатьРезультатСканирования(РезультатСканирования); 
		Если Результат <> "null" Тогда 
			ПроигратьЗвук(Результат); 
			Если ТипСканераСтрокой = "СтационарныйВъезд" и Результат = "ok" Тогда
				ОткрытьШлагбаумОбщая(ДанныеДатчика.АдресСервераСКУД, ДанныеДатчика.IDШлагбаумаВъезд);
			КонецЕсли;   
			Если ТипСканераСтрокой = "СтационарныйВыезд" и Результат = "out" Тогда 
				ОткрытьШлагбаумОбщая(ДанныеДатчика.АдресСервераСКУД, ДанныеДатчика.IDШлагбаумаВыезд);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЕсли;
		
	ЗаполнитьТЗСервер();
КонецПроцедуры

&НаКлиенте                                            	
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗонаДоступаПриИзменении(Элемент)
	
	ЗонаДоступаПриИзмененииНаСервере();
	
КонецПроцедуры
&НаСервере 
Процедура ЗонаДоступаПриИзмененииНаСервере()
	ЭтоСКУД= Датчик.СКУД;
	ЗаполнитьТЗСервер();
КонецПроцедуры

&НаКлиенте
Процедура ТЗСобытияСКУДВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы   

&НаКлиенте
Процедура СписокПропусков(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Доступ", ЗонаДоступа);
	
	ОткрытьФорму("Документ.Пропуск.Форма.ФормаСпискаСОтбором", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Аутсорс(Команда)
	
	ОткрытьФормуПропуска(ПредопределенноеЗначение("Справочник.ЦелиПосещения.Аутсорс"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВывозМусора(Команда)
	
	ОткрытьФормуПропуска(ПредопределенноеЗначение("Справочник.ЦелиПосещения.ВывозМусора"));
	
КонецПроцедуры   

&НаКлиенте
Процедура Подрядчик(Команда)
	
	ОткрытьФормуПропуска(ПредопределенноеЗначение("Справочник.ЦелиПосещения.Подрядчик"));
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент(Команда)
	
	ОткрытьФормуПропуска(ПредопределенноеЗначение("Справочник.ЦелиПосещения.КлиентПрочее"));
	
КонецПроцедуры

&НаКлиенте
Процедура Собеседование(Команда)
	ОткрытьФормуПропуска(ПредопределенноеЗначение("Справочник.ЦелиПосещения.Собеседование"));
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуПропуска(ЦельПосещения)
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ЗонаДоступа", ЗонаДоступа);
	ПараметрыЗаполнения.Вставить("ЦельПосещения", ЦельПосещения);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Документ.Пропуск.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьВсюИсторию(Команда)
	Отбор = Новый Структура;
	Отбор.Вставить("ЗонаДоступа", ЗонаДоступа);  
	//Отбор.Вставить("Датчик", Датчик);  
	ОткрытьФорму("РегистрСведений.ИсторияДоступа.ФормаСписка", Новый Структура("Отбор", Отбор));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОпределитьIp() 
	
	IpАдрес = Неопределено;
	COMОбъект = ПолучитьCOMОбъект("winmgmts:\\.\root\CIMV2");	
	
	Результат = COMОбъект.ExecQuery("SELECT * FROM 
	|Win32_NetworkAdapterConfiguration 
	|WHERE IPEnabled = TRUE");
	
	Для Каждого Строка Из Результат Цикл	
		Для Каждого ПодСтрока Из Строка.IPAddress Цикл
			IpАдрес = ПодСтрока;
			Возврат IpАдрес;
		КонецЦикла;	
	КонецЦикла; 
	
КонецФункции

&НаСервере 
Процедура ПолучитьЗначенияПараметров();
	
	Датчик = Справочники.ДатчикиСКУД.НайтиПоКоду(Ip, Истина);
	Если Датчик <> Справочники.ДатчикиСКУД.ПустаяСсылка() Тогда
		ЗонаДоступа = УправлениеДоступомСервер.ПолучитьЗонуДоступаДатчика(Датчик);
	КонецЕсли;
	ЭтоСКУД = Датчик.СКУД; 
	ЗаполнитьТЗСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОжидании()	
КонецПроцедуры

&НаСервере
Функция ПроверитьНеобходимостьПодтвержднияЗаписи(Датчик, ДатаСобытия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИсторияДоступа.Событие КАК Событие,
	|	ИсторияДоступа.ДатаСобытия КАК ДатаСобытия,
	|	ИсторияДоступа.Объект КАК Документ
	|ИЗ
	|	РегистрСведений.ИсторияДоступа КАК ИсторияДоступа
	|ГДЕ
	|	ИсторияДоступа.ТребуетсяПодтверждение
	|	И ИсторияДоступа.Событие = ЗНАЧЕНИЕ(Перечисление.СобытиеСКУД.ПустаяСсылка)
	|	И ИсторияДоступа.Датчик = &Датчик
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия УБЫВ";
	Запрос.УстановитьПараметр("Датчик", Датчик);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	ДатаСобытия = Выборка.ДатаСобытия; 
	Возврат Выборка.Документ;
	
КонецФункции

&НаКлиенте
Процедура ПодтвержденияНаКППЗавершение(Результат, ДопПараметры) Экспорт 	
	ЗаполнитьТЗСервер();
КонецПроцедуры 

#Область ФункцииРаботыСоЗвуком
&НаКлиенте
Процедура ПроигратьЗвук(Звук)
	
	Попытка
		ДанныеЗвука = ПолучитьМакет(Звук);
		ИмяВременногоФайла = КаталогВременныхФайлов() + Звук + ".wav";
		ДанныеЗвука.Записать(ИмяВременногоФайла);	
		oVoice = Новый COMObject("SAPI.SpVoice");
		oSpFileStream = Новый COMObject("SAPI.SpFileStream");
		oSpFileStream.Open(ИмяВременногоФайла);
		oVoice.SpeakStream(oSpFileStream);
		oSpFileStream.Close();
	Исключение
		Сообщить("Ошибка: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(Звук)
	
	ОбъектО = РеквизитФормыВЗначение("Объект");
	ДанныеЗвука = ОбъектО.ПолучитьМакет(Звук);
	Возврат ДанныеЗвука;
	
КонецФункции
#КонецОбласти

#КонецОбласти

#Область ЗаполнитьТЗ

&НаКлиенте 
Процедура ЗаполнитьТЗ() Экспорт
	ЗаполнитьТЗСервер();
КонецПроцедуры
&НаСервере 
Процедура ЗаполнитьТЗСервер() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияДоступа.Объект КАК Пропуск,
	|	ИсторияДоступа.Событие КАК Событие,
	|	ИсторияДоступа.ДатаСобытия КАК ДатаСобытия,
	|	ИсторияДоступа.ЦельПосещения КАК ЦельПосещения,
	|	ИсторияДоступа.Комментарий КАК Ошибка,
	|	ИсторияДоступа.ЗонаДоступа КАК ЗонаДоступа,
	|	ИсторияДоступа.ФИО КАК ФИО,
	|	ИсторияДоступа.ТипСканераКПП КАК ТипСканера
	|ИЗ
	|	РегистрСведений.ИсторияДоступа КАК ИсторияДоступа
	|ГДЕ
	|	ИсторияДоступа.ДатаСобытия МЕЖДУ &Дата1 И &Дата2
	|	И ИсторияДоступа.ЗонаДоступа = &ЗонаДоступа
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСобытия УБЫВ";
	
	Запрос.УстановитьПараметр("Дата1", Период.ДатаНачала);
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ЗонаДоступа", ЗонаДоступа);
	//Запрос.УстановитьПараметр("Датчик", Датчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗСобытияСКУД.Загрузить(РезультатЗапроса.Выгрузить());
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьШлагбаумОбщая(АдресСервера, idШлагбаума)
	
	s="";
	//"192.168.0.33"
	Подключение=СКУД.Initialize(АдресСервера,"admin","",s);    	
	//
	
	//Данный кусок нужно для получения информации по драйвера шлагбаума на случай, если они сменятся
	//s="";
	//Ин=СКУД.GetAcsAccessPointDrivers(s);
	//Сообщить(Ин);
	//Сообщить(s);
	
	//Открываем шлагбаум 
	Ин=СКУД.Process(idШлагбаума,"Open");
	
	//
	//Отключаемся от сервера 
	Подключение = СКУД.Deinitialize();
	//
	
КонецПроцедуры
&НаСервере
Функция ПолучитьДанныеДатчика(ip)
	Датчик = Справочники.ДатчикиСКУД.НайтиПоКоду(Ip, Истина);
	Структура = Новый Структура; 
	Структура.Вставить("АдресСервераСКУД", Датчик.АдресСервераСКУД); 
	Структура.Вставить("IdШлагбаумаВъезд", Датчик.IDШлагбаумаВъезд); 
	Структура.Вставить("IdШлагбаумаВыезд", Датчик.IDШлагбаумаВыезд);
	Структура.Вставить("СКУД", ДАтчик.СКУД); 
	Возврат Структура; 
КонецФункции 


&НаКлиенте
Процедура ОткрытьШлагбаум1(Команда)
	ПроигратьЗвук("ok");
	ДанныеДатчика = ПолучитьДанныеДатчика(ip); 
	ОткрытьШлагбаумОбщая(ДанныеДатчика.АдресСервераСКУД, ДанныеДатчика.IDШлагбаумаВъезд);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьШлагбаум2(Команда)
	ПроигратьЗвук("out");
	ДанныеДатчика = ПолучитьДанныеДатчика(ip);  
	ОткрытьШлагбаумОбщая(ДанныеДатчика.АдресСервераСКУД, ДанныеДатчика.IDШлагбаумаВыезд);
КонецПроцедуры

#КонецОбласти
